package Lesson3;
//Создать новый проект, запушить его на удалённый репозиторий GitHub. Сделать
//несколько коммитов в мастер ветке. Создать отдельную ветку, переключиться на неё и
//сделать несколько коммитов. Смержить в мастер ветку. Все последующие решения
//Домашних заданий присылать в GitHub(ссылка на репозиторий).
public class Main {
    public static void main(String[] args){
System.out.println("Lesson2.2 done");
    }
}
